In [1]:
import pandas as pd

In [7]:
df = pd.read_csv("student.csv")

In [8]:
df

    No   Name   Age Dept  Mark
0  101   Arun  20.0  CSE    85
1  102  Meena  19.0   IT    90
2  103  Rahul   NaN  ECE    78
3  104    NaN  21.0  CSE    92
4  105  Kavya  20.0  NaN    88

In [9]:
df.describe()

               No        Age       Mark
count    5.000000   4.000000   5.000000
mean   103.000000  20.000000  86.600000
std      1.581139   0.816497   5.458938
min    101.000000  19.000000  78.000000
25%    102.000000  19.750000  85.000000
50%    103.000000  20.000000  88.000000
75%    104.000000  20.250000  90.000000
max    105.000000  21.000000  92.000000

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   No      5 non-null      int64
 1   Name    4 non-null      object
 2   Age     4 non-null      float64
 3   Dept    4 non-null      object
 4   Mark    5 non-null      int64
dtypes: float64(1), int64(2), object(2)
memory usage: 332.0+ bytes

In [11]:
df.isnull().sum()

No      0
Name    1
Age     1
Dept    1
Mark    0
dtype: int64

In [16]:
df.dtypes

No        int64
Name     object
Age     float64
Dept     object
Mark      int64
dtype: object

In [17]:
df.shape

(5, 5)

In [19]:
df1 = df.fillna("n")
df1

    No   Name   Age Dept  Mark
0  101   Arun  20.0  CSE    85
1  102  Meena  19.0   IT    90
2  103  Rahul     n  ECE    78
3  104      n  21.0  CSE    92
4  105  Kavya  20.0    n    88

In [20]:
df1.fillna({'Name': 1 , 'Age' : 2},inplace=True)
df1

    No   Name   Age Dept  Mark
0  101   Arun  20.0  CSE    85
1  102  Meena  19.0   IT    90
2  103  Rahul     n  ECE    78
3  104      n  21.0  CSE    92
4  105  Kavya  20.0    n    88

In [23]:
df2= df.fillna(method = 'ffill')
df2

/var/folders/b4/9ggb2r7d09s5zfxhn_l89pc80000gn/T/ipykernel_29611/2205955881.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df2= df.fillna(method = 'ffill')

    No   Name   Age Dept  Mark
0  101   Arun  20.0  CSE    85
1  102  Meena  19.0   IT    90
2  103  Rahul  19.0  ECE    78
3  104  Rahul  21.0  CSE    92
4  105  Kavya  20.0  CSE    88

In [25]:
df3 = df.fillna(method='bfill')
df3

/var/folders/b4/9ggb2r7d09s5zfxhn_l89pc80000gn/T/ipykernel_29611/1761638241.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df3 = df.fillna(method='bfill')

    No   Name   Age Dept  Mark
0  101   Arun  20.0  CSE    85
1  102  Meena  19.0   IT    90
2  103  Rahul  21.0  ECE    78
3  104  Kavya  21.0  CSE    92
4  105  Kavya  20.0  NaN    88

In [26]:
df4 = df.interpolate()
df4

/var/folders/b4/9ggb2r7d09s5zfxhn_l89pc80000gn/T/ipykernel_29611/2367887036.py:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df4 = df.interpolate()

    No   Name   Age Dept  Mark
0  101   Arun  20.0  CSE    85
1  102  Meena  19.0   IT    90
2  103  Rahul  20.0  ECE    78
3  104    NaN  21.0  CSE    92
4  105  Kavya  20.0  NaN    88

In [28]:
df5= df4.dropna(subset=['Name', 'Dept'])
df5

    No   Name   Age Dept  Mark
0  101   Arun  20.0  CSE    85
1  102  Meena  19.0   IT    90
2  103  Rahul  20.0  ECE    78

In [29]:
df6 = df.dropna()
df6

    No   Name   Age Dept  Mark
0  101   Arun  20.0  CSE    85
1  102  Meena  19.0   IT    90